responseMessages = {
    1001: "講義ID「{0}」の検索で接続エラーが発生しました",
    1404: "講義ID「{0}」は存在しません",
    2001: "「{0}」の検索で接続エラーが発生しました",
    2404: "「{0}」は見つかりませんでした",
    3001: "ユーザー「{0}」のお気に入りの取得で接続エラーが発生しました",
    3002: "ユーザー「{0}」のお気に入りの追加で接続エラーが発生しました",
    3003: "ユーザー「{0}」のお気に入りの削除で接続エラーが発生しました",
    3404: "ユーザー「{0}」のお気に入りはまだありません。",
    3405: "すでにお気に入り登録されています",
    3406: "ユーザー「{0}」に「{1}」をお気に入り登録しました",
    3407: "ユーザー「{0}」の講義ID「{1}」をお気に入り削除しました",
    3408: "講義ID「{}」はお気に入り登録されていません",
    3409: "講義ID「{}」はすでに削除されているかお気に入り登録されていません",
    4001: "{0}おみくじで接続エラーが発生しました",
    4002: "{0}おみくじは存在しません",
    4404: "{0}おみくじに該当する講義が見つかりませんでした"
}
